{"Pages":{"1":"","Add <code>.navbar-fixed-bottom</code> instead.":"","Static top navbar":"","Create a full-width navbar that scrolls away with the page by adding <code>.navbar-static-top</code>. Unlike the <code>.navbar-fixed-top</code> class, you do not need to change any padding on the <code>body</code>.":"","To implement a collapsing responsive navbar, wrap your navbar content in a containing div, <code>.nav-collapse.collapse</code>, and add the navbar toggle button, <code>.btn-navbar</code>.":"","Inverted variation":"","Modify the look of the navbar by adding <code>.navbar-inverse</code>.":"","Standard pagination":"","Simple pagination inspired by Rdio, great for apps and search results. The large block is hard to miss, easily scalable, and provides large click areas.":"","Disabled and active states":"","Links are customizable for different circumstances. Use <code>.disabled</code> for unclickable links and <code>.active</code> to indicate the current page.":"","Alignment":"","Add one of two optional classes to change the alignment of pagination links: <code>.pagination-centered</code> and <code>.pagination-right</code>.":"","Quick previous and next links for simple pagination implementations with light markup and styles. It's great for simple sites like blogs or magazines.":"","Pager links also use the general <code>.disabled</code> utility class from the pagination.":"","A lightweight, flexible component to showcase key content on your site. It works well on marketing and content-heavy sites.":"","Thumbnail caption...":"","Default alert":"","Wrap any text and an optional dismiss button in <code>.alert</code> for a basic warning alert message.":"","Dismiss buttons":"","Mobile Safari and Mobile Opera browsers, in addition to the <code>data-dismiss=\"alert\"</code> attribute, require an <code>href=\"#\"</code> for the dismissal of alerts when using an <code>&lt;a&gt;</code> tag.":"","Alternatively, you may use a <code>&lt;button&gt;</code> element with the data attribute, which we have opted to do for our docs. When using <code>&lt;button&gt;</code>, you must include <code>type=\"button\"</code> or your forms may not submit.":"","Dismiss alerts via javascript":"","Use the <a href=\"./javascript.html#alerts\">alerts jQuery plugin</a> for quick and easy dismissal of alerts.":"","For longer messages, increase the padding on the top and bottom of the alert wrapper by adding <code>.alert-block</code>.":"","Add optional classes to change an alert's connotation.":"","Uses a gradient to create a striped effect. Not available in IE7-8.":"","Add <code>.active</code> to <code>.progress-striped</code> to animate the stripes right to left. Not available in all versions of IE.":"","Versions earlier than Internet Explorer 10 and Opera 12 do not support animations.":"","Control padding and rounded corners with two optional modifier classes.":"","Helper classes":"","Simple, focused classes for small display or behavior tweaks.":"",".pull-left":"","Float an element left":"",".pull-right":"","Float an element right":"",".muted":"","Change an element's color to <code>#999</code>":"",".clearfix":"","Clear the <code>float</code> on any element":"","<a href=\"https://github.com/twitter/bootstrap/zipball/master\">Download Bootstrap</a> or customize variables, components, javascript plugins, and more.":"","Affix":"","Extending Bootstrap":"","Extend Bootstrap to take advantage of included styles and components, as well as LESS variables and mixins.":"","Use as static assets":"","One of Bootstrap's creators wrote a quick <a href=\"http://www.wordsbyf.at/2012/03/08/why-less/\">blog post about this</a>, summarized here:":"","Bootstrap compiles faster ~6x faster with Less compared to Sass":"","Less is written in JavaScript, making it easier to us to dive in and patch compared to Ruby with Sass.":"","Less is more; we want to feel like we're writing CSS and making Bootstrap approachable to all.":"","Compiling Bootstrap with Less":"","Since our CSS is written with Less and utilizes variables and mixins, it needs to be compiled for final production implementation. Here's how.":"","<a href=\"http://incident57.com/less/\">The unofficial Mac app</a> watches directories of .less files and compiles the code to local files after every save of a watched .less file. If you like, you can toggle preferences in the app for automatic minifying and which directory the compiled files end up in.":"","More apps":"","Mac, Linux, and Windows app for drag and drop compiling of LESS files. Plus, the <a href=\"https://github.com/Paratron/SimpLESS\" target=\"_blank\">source code is on GitHub</a>.":"","<a href=\"./getting-started.html\">Quickly start</a> any web project by dropping in the compiled or minified CSS and JS. Layer on custom styles separately for easy upgrades and maintenance moving forward.":"","Setup file structure":"","Download the latest compiled Bootstrap and place into your project. For example, you might have something like this:":"","Utilize starter template":"","Copy the following base HTML to get started.":"","Layer on custom code":"","Work in your custom CSS, JS, and more as necessary to make Bootstrap your own with your own separate CSS and JS files.":"","Getting started":"","Overview of the project, it's contents, and how to get started with a simple template.":"","File structure":"","HTML template":"","What next?":"","1. Download":"","Before downloading, be sure to have a code editor (we recommend <a href=\"http://sublimetext.com/2\">Sublime Text 2</a>) and some working knowledge of HTML and CSS. We won't walk through the source files here, but they are available for download. We'll focus on getting started with our the compiled Bootstrap files.":"","2. File structure":"","Within the download you'll find the following file structure and contents, logically grouping common assets and providing both compiled and minified variations.":"","Once downloaded, unzip the compressed folder to see the structure of (the compiled) Bootstrap. You'll see something like this:":"","This is the most basic form of Bootstrap: compiled files for quick drop-in usage in nearly any web project. We provide compiled CSS and JS (<code>bootstrap.*</code>), as well as compiled and minified CSS and JS (<code>bootstrap.min.*</code>). The image files are compressed using <a href=\"http://imageoptim.com/\">ImageOptim</a>, a Mac app for compressing PNGs.":"","3. What's included":"","Bootstrap comes equipped with HTML, CSS, and JS for all sorts of things, but they can be summarized with a handful of categories visible at the top of the <a href=\"http://getbootstrap.com\">Bootstrap documentation</a>.":"","Docs sections":"","Global styles for the body to reset type and background, link styles, grid system, and two simple layouts.":"","Styles for common HTML elements like typography, code, tables, forms, and buttons. Also includes <a href=\"http://glyphicons.com\">Glyphicons</a>, a great little icon set.":"","Basic styles for common interface components like tabs and pills, navbar, alerts, page headers, and more.":"","Similar to Components, these Javascript plugins are interactive components for things like tooltips, popovers, modals, and more.":"","List of components":"","Together, the <strong>Components</strong> and <strong>Javascript plugins</strong> sections provide the following interface elements:":"","Navigational tabs, pills, and lists":"","Page headers and hero unit":"","Accordion":"","In future guides, we may walk through these components individually in more detail. Until then, look for each of these in the documentation for information on how to utilize and customize them.":"","4. Basic HTML template":"","With a brief intro into the contents out of the way, we can focus putting Bootstrap to use. To do that, we'll utilize a basic HTML template that includes everything we mentioned in the <a href=\"#file-structure\">File structure</a>.":"","Now, here's a look at a <strong>typical HTML file</strong>:":"","To make this <strong>a Bootstrapped template</strong>, just include the appropriate CSS and JS files:":"","<strong>And you're set!</strong> With those two files added, you can begin to develop any site or application with Bootstrap.":"","5. Examples":"","Move beyond the base template with a few example layouts. We encourage folks to iterate on these examples and not simply use them as an end result.":"","Download Bootstrap":"","Introducing Bootstrap.":"","By nerds, for nerds.":"","Built at Twitter by <a href=\"http://twitter.com/mdo\">@mdo</a> and <a href=\"http://twitter.com/fat\">@fat</a>, Bootstrap utilizes <a href=\"http://lesscss.org\">LESS CSS</a>, is compiled via <a href=\"http://nodejs.org\">Node</a>, and is managed through <a href=\"http://github.com\">GitHub</a> to help nerds do awesome stuff on the web.":"","Made for everyone.":"","Bootstrap was made to not only look and behave great in the latest desktop browsers (as well as IE7!), but in tablet and smartphone browsers via <a href=\"./scaffolding.html#responsive\">responsive CSS</a> as well.":"","Packed with features.":"","A 12-column responsive <a href=\"./scaffolding.html#grid\">grid</a>, dozens of components, <a href=\"./javascript.html\">javascript plugins</a>, typography, form controls, and even a <a href=\"./customize.html\">web-based Customizer</a> to make Bootstrap your own.":"","For even more sites built with Bootstrap, <a href=\"http://builtwithbootstrap.tumblr.com/\" target=\"_blank\">visit the unofficial Tumblr</a> or <a href=\"./getting-started.html#examples\">browse the examples</a>.":"","JavaScript for Bootstrap":"","Bring Bootstrap's components to life&mdash;now with 13 custom jQuery plugins.":"","Overview":"","JavaScript in Bootstrap":"","Individual or compiled":"","If you have downloaded the latest version of Bootstrap, both <strong>bootstrap.js</strong> and <strong>bootstrap.min.js</strong> contain all of the plugins listed on this page.":"","Data attributes":"","You can use all Bootstrap plugins purely through the markup API without writing a single line of JavaScript. This is Bootstrap's first class API and should be your first consideration when using a plugin.":"","That said, in some situations it may be desirable to turn this functionality off. Therefore, we also provide the ability to disable the data attribute API by unbinding all events on the body namespaced with `'data-api'`. This looks like this:":"","Alternatively, to target a specific plugin, just include the plugins name as a namespace along with the data-api namespace like this:":"","Programmatic API":"","We also believe you should be able to use all Bootstrap plugins purely through the JavaScript API. All public APIs are single, chainable methods, and return the collection acted upon.":"","All methods should accept an optional options object, a string which targets a particular method, or nothing (which initiates a plugin with default behavior):":"","Each plugin also exposes it's raw constructor on a `Constructor` property: <code>$.fn.popover.Constructor</code>. If you'd like to get a particular plugin instance, retrieve it directly from an element: <code>$('[rel=popover]').data('popover')</code>.":"","Bootstrap provides custom events for most plugin's unique actions. Generally, these come in an infinitive and past participle form - where the infinitive (ex. <code>show</code>) is triggered at the start of an event, and it's past participle form (ex. <code>shown</code>) is trigger on the completion of an action.":"","All infinitive events provide preventDefault functionality. This provides the abililty to stop the execution of an action before it starts.":"","About transitions":"","For simple transition effects, include bootstrap-transition.js once alongside the other JS files. If you're using the compiled (or minified) bootstrap.js, there is no need to include this&mdash;it's already there.":"","A few examples of the transition plugin:":"","Sliding or fading in modals":"","Fading out tabs":"","Fading out alerts":"","Sliding carousel panes":"","Modals are streamlined, but flexible, dialog prompts with the minimum required functionality and smart defaults.":"","A rendered modal with header, body, and set of actions in the footer.":"","Toggle a modal via JavaScript by clicking the button below. It will slide down and fade in from the top of the page.":"","This <a href=\"#\" role=\"button\" class=\"btn popover-test\" title=\"A Title\" data-content=\"And here's some amazing content. It's very engaging. right?\">button</a> should trigger a popover on hover.":"","Via data attributes":"","Activate a modal without writing JavaScript. Set <code>data-toggle=\"modal\"</code> on a controller element, like a button, along with a <code>data-target=\"#foo\"</code> or <code>href=\"#foo\"</code> to target a specific modal to toggle.":"","Via JavaScript":"","Call a modal with id <code>myModal</code> with a single line of JavaScript:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-backdrop=\"\"</code>.":"","remote":"","path":"","false":"","If a remote url is provided, content will be loaded via jQuery's <code>load</code> method and injected into the <code>.modal-body</code>. If you're using the data api, you may alternatively use the <code>href</code> tag to specify the remote source. An example of this is shown below:":"","Add dropdown menus to nearly anything with this simple plugin, including the navbar, tabs, and pills.":"","Within a navbar":"","Within tabs":"","Add <code>data-toggle=\"dropdown\"</code> to a link or button to toggle a dropdown.":"","Call the dropdowns via JavaScript:":"","Example in navbar":"","The ScrollSpy plugin is for automatically updating nav targets based on scroll position. Scroll the area below the navbar and watch the active class change. The dropdown sub items will be highlighted as well.":"","To easily add scrollspy behavior to your topbar navigation, just add <code>data-spy=\"scroll\"</code> to the element you want to spy on (most typically this would be the body) and <code>data-target=\".navbar\"</code> to select which nav to use. You'll want to use scrollspy with a <code>.nav</code> component.":"","Call the scrollspy via JavaScript:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-offset=\"\"</code>.":"","Add quick, dynamic tab functionality to transiton through panes of local content, even via dropdown menus.":"","Enable tabbable tabs via JavaScript (each tab needs to be activated individually):":"","You can activate a tab or pill navigation without writing any JavaScript by simply specifying <code>data-toggle=\"tab\"</code> or <code>data-toggle=\"pill\"</code> on an element. Adding the <code>nav</code> and <code>nav-tabs</code> classes to the tab <code>ul</code> will apply the Bootstrap tab styling.":"","Inspired by the excellent jQuery.tipsy plugin written by Jason Frame; Tooltips are an updated version, which don't rely on images, use CSS3 for animations, and data-attributes for local title storage.":"","Tight pants next level keffiyeh <a href=\"#\" rel=\"tooltip\" title=\"Default tooltip\">you probably</a> haven't heard of them. Photo booth beard raw denim letterpress vegan messenger bag stumptown. Farm-to-table seitan, mcsweeney's fixie sustainable quinoa 8-bit american apparel <a href=\"#\" rel=\"tooltip\" title=\"Another tooltip\">have a</a> terry richardson vinyl chambray. Beard stumptown, cardigans banh mi lomo thundercats. Tofu biodiesel williamsburg marfa, four loko mcsweeney's cleanse vegan chambray. A really ironic artisan <a href=\"#\" rel=\"tooltip\" title=\"Another one here too\">whatever keytar</a>, scenester farm-to-table banksy Austin <a href=\"#\" rel=\"tooltip\" title=\"The last tip!\">twitter handle</a> freegan cred raw denim single-origin coffee viral.":"","Four directions":"","Trigger the tooltip via JavaScript:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-animation=\"\"</code>.":"","html":"","Insert html into the tooltip. If false, jquery's <code>text</code> method will be used to insert content into the dom. Use text if you're worried about XSS attacks.":"","Hides and destroys an element's tooltip.":"","Add small overlays of content, like those on the iPad, to any element for housing secondary information. Hover over the button to trigger the popover. <strong>Requires <a href=\"#tooltips\">Tooltip</a> to be included.</strong>":"","Static popover":"","Four options are available: top, right, bottom, and left aligned.":"","No markup shown as popovers are generated from JavaScript and content within a <code>data</code> attribute.":"","Click to toggle popover":"","Enable popovers via JavaScript:":"","Insert html into the popover. If false, jquery's <code>text</code> method will be used to insert content into the dom. Use text if you're worried about XSS attacks.":"","how popover is triggered":"","Hides and destroys an element's popover.":"","Add dismiss functionality to all alerge messages with this plugin.":"","Enable dismissal of an alert via JavaScript:":"","Add data-loading-text=\"Loading...\" to use a loading state on a button.":"","Loading state":"","Add data-toggle=\"button\" to activate toggling on a single button.":"","Add data-toggle=\"buttons-checkbox\" for checkbox style toggling on btn-group.":"","Add data-toggle=\"buttons-radio\" for radio style toggling on btn-group.":"","Enable buttons via JavaScript:":"","Enable manually with:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-parent=\"\"</code>.":"","The slideshow below shows a generic plugin and component for cycling through elements like a carousel.":"","...":"","Call carousel manually with:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-interval=\"\"</code>.":"","Add data attributes to register an element with typeahead functionality as shown in the example above.":"","Call the typeahead manually with:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-source=\"\"</code>.":"","array, function":"","The data source to query against. May be an array of strings or a function. The function is passed two arguments, the <code>query</code> value in the input field and the <code>process</code> callback. The function may be used synchronously by returning the data source directly or asynchronously via the <code>process</code> callback's single argument.":"","minLength":"","The minimum character length needed before triggering autocomplete suggestions":"","The subnavigation on the left is a live demo of the affix plugin.":"","To easily add affix behavior to any element, just add <code>data-spy=\"affix\"</code> to the element you want to spy on. Then use offsets to define when to toggle the pinning of an element on and off.":"","It's up to you to manage the position of a pinned element. This is done by styling <code>affix</code>, <code>affix-top</code>, and <code>affix-bottom</code>.":"","Call the affix plugin via JavaScript:":"","When using affix in conjunction with adding or removing of elements from the DOM, you'll want to call the refresh method:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-offset-top=\"200\"</code>.":"","number | function | object":"","Pixels to offset from screen when calculating position of scroll. If a single number is provide, the offset will be applied in both top and left directions. To listen for a single direction, or multiple unique offsets, just provided an object <code>offset: { x: 10 }</code>. Use a function when you need to dynamically provide an offset (useful for some responsive designs).":"","Bootstrap is built on responsive 12-column grids, layouts, and components.":"","Global settings":"","Bootstrap makes use of certain HTML elements and CSS properties that require the use of the HTML5 doctype. Include it at the beginning of all your projects.":"","Bootstrap sets basic global display, typography, and link styles. Specifically, we:":"","Remove <code>margin</code> on the body":"","Use the <code>@baseFontFamily</code>, <code>@baseFontSize</code>, and <code>@baseLineHeight</code> attributes as our typographic base":"","These styles can be found within <strong>scaffolding.less</strong>.":"","With Bootstrap 2, the old reset block has been dropped in favor of <a href=\"http://necolas.github.com/normalize.css/\" target=\"_blank\">Normalize.css</a>, a project by <a href=\"http://twitter.com/necolas\" target=\"_blank\">Nicolas Gallagher</a> that also powers the <a href=\"http://html5boilerplate.com\" target=\"_blank\">HTML5 Boilerplate</a>. While we use much of Normalize within our <strong>reset.less</strong>, we have removed some elements specifically for Bootstrap.":"","Default grid system":"","Live grid example":"","The default Bootstrap grid system utilizes <strong>12 columns</strong>, making for a 940px wide container without <a href=\"#responsive\">responsive features</a> enabled. With the responsive CSS file added, the grid adapts to be 724px and 1170px wide depending on your viewport. Below 767px viewports, the columns become fluid and stack vertically.":"","Basic grid HTML":"","For a simple two column layout, create a <code>.row</code> and add the appropriate number of <code>.span*</code> columns. As this is a 12-column grid, each <code>.span*</code> spans a number of those 12 columns, and should always add up to 12 for each row (or the number of columns in the parent).":"","Given this example, we have <code>.span4</code> and <code>.span8</code>, making for 12 total columns and a complete row.":"","Move columns to the left using <code>.offset*</code> classes. Each class increases the left margin of a column by a whole column. For example, <code>.offset4</code> moves <code>.span4</code> over four columns.":"","To nest your content with the default grid, add a new <code>.row</code> and set of <code>.span*</code> columns within an existing <code>.span*</code> column. Nested rows should include a set of columns that add up to the number of columns of its parent.":"","Live fluid grid example":"","The fluid grid system uses percents instead of pixels for column widths. It has the same responsive capabilities as our fixed grid system, ensuring proper proportions for key screen resolutions and devices.":"","Basic fluid grid HTML":"","Make any row \"fluid\" by changing <code>.row</code> to <code>.row-fluid</code>. The column classes stay the exact same, making it easy to flip between fixed and fluid grids.":"","Fluid offsetting":"","Operates the same way as the fixed grid system offsetting: add <code>.offset*</code> to any column to offset by that many columns.":"","Nesting with fluid grids is a bit different: the number of nested columns should not match the parent's number of columns. Instead, each level of nested columns are reset because each row takes up 100% of the parent column.":"","Provides a common fixed-width (and optionally responsive) layout with only <code>&lt;div class=\"container\"&gt;</code> required.":"","Create a fluid, two-column page with <code>&lt;div class=\"container-fluid\"&gt;</code>&mdash;great for applications and docs.":"","Enabling responsive features":"","Turn on responsive CSS in your project by including the proper meta tag and additional stylesheet within the <code>&lt;head&gt;</code> of your document. If you've compiled Bootstrap from the Customize page, you need only include the meta tag.":""," Bootstrap doesn't include responsive features by default at this time as not everything needs to be responsive. Instead of encouraging developers to remove this feature, we figure it best to enable it as needed.":"","About responsive Bootstrap":"","Phones":"","Phones to tablets":"","For faster mobile-friendly development, use these utility classes for showing and hiding content by device. Below is a table of the available classes and their effect on a given media query layout (labeled by device). They can be found in <code>responsive.less</code>.":"","Phones <small>767px and below</small>":"","Tablets <small>979px to 768px</small>":"","Desktops <small>Default</small>":"","Responsive utilities test case":""}}