{"Pages":{"1":"","remote":"","path":"","false":"","If a remote url is provided, content will be loaded via jQuery's <code>load</code> method and injected into the <code>.modal-body</code>. If you're using the data api, you may alternatively use the <code>href</code> tag to specify the remote source. An example of this is shown below:":"","Add dropdown menus to nearly anything with this simple plugin, including the navbar, tabs, and pills.":"","Within a navbar":"","Within tabs":"","Add <code>data-toggle=\"dropdown\"</code> to a link or button to toggle a dropdown.":"","Call the dropdowns via JavaScript:":"","Example in navbar":"","The ScrollSpy plugin is for automatically updating nav targets based on scroll position. Scroll the area below the navbar and watch the active class change. The dropdown sub items will be highlighted as well.":"","To easily add scrollspy behavior to your topbar navigation, just add <code>data-spy=\"scroll\"</code> to the element you want to spy on (most typically this would be the body) and <code>data-target=\".navbar\"</code> to select which nav to use. You'll want to use scrollspy with a <code>.nav</code> component.":"","Call the scrollspy via JavaScript:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-offset=\"\"</code>.":"","Add quick, dynamic tab functionality to transiton through panes of local content, even via dropdown menus.":"","Enable tabbable tabs via JavaScript (each tab needs to be activated individually):":"","You can activate a tab or pill navigation without writing any JavaScript by simply specifying <code>data-toggle=\"tab\"</code> or <code>data-toggle=\"pill\"</code> on an element. Adding the <code>nav</code> and <code>nav-tabs</code> classes to the tab <code>ul</code> will apply the Bootstrap tab styling.":"","Inspired by the excellent jQuery.tipsy plugin written by Jason Frame; Tooltips are an updated version, which don't rely on images, use CSS3 for animations, and data-attributes for local title storage.":"","Tight pants next level keffiyeh <a href=\"#\" rel=\"tooltip\" title=\"Default tooltip\">you probably</a> haven't heard of them. Photo booth beard raw denim letterpress vegan messenger bag stumptown. Farm-to-table seitan, mcsweeney's fixie sustainable quinoa 8-bit american apparel <a href=\"#\" rel=\"tooltip\" title=\"Another tooltip\">have a</a> terry richardson vinyl chambray. Beard stumptown, cardigans banh mi lomo thundercats. Tofu biodiesel williamsburg marfa, four loko mcsweeney's cleanse vegan chambray. A really ironic artisan <a href=\"#\" rel=\"tooltip\" title=\"Another one here too\">whatever keytar</a>, scenester farm-to-table banksy Austin <a href=\"#\" rel=\"tooltip\" title=\"The last tip!\">twitter handle</a> freegan cred raw denim single-origin coffee viral.":"","Four directions":"","Trigger the tooltip via JavaScript:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-animation=\"\"</code>.":"","html":"","Insert html into the tooltip. If false, jquery's <code>text</code> method will be used to insert content into the dom. Use text if you're worried about XSS attacks.":"","Hides and destroys an element's tooltip.":"","Add small overlays of content, like those on the iPad, to any element for housing secondary information. Hover over the button to trigger the popover. <strong>Requires <a href=\"#tooltips\">Tooltip</a> to be included.</strong>":"","Static popover":"","Four options are available: top, right, bottom, and left aligned.":"","No markup shown as popovers are generated from JavaScript and content within a <code>data</code> attribute.":"","Click to toggle popover":"","Enable popovers via JavaScript:":"","Insert html into the popover. If false, jquery's <code>text</code> method will be used to insert content into the dom. Use text if you're worried about XSS attacks.":"","how popover is triggered":"","Hides and destroys an element's popover.":"","Add dismiss functionality to all alerge messages with this plugin.":"","Enable dismissal of an alert via JavaScript:":"","Add data-loading-text=\"Loading...\" to use a loading state on a button.":"","Loading state":"","Add data-toggle=\"button\" to activate toggling on a single button.":"","Add data-toggle=\"buttons-checkbox\" for checkbox style toggling on btn-group.":"","Add data-toggle=\"buttons-radio\" for radio style toggling on btn-group.":"","Enable buttons via JavaScript:":"","Enable manually with:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-parent=\"\"</code>.":"","The slideshow below shows a generic plugin and component for cycling through elements like a carousel.":"","...":"","Call carousel manually with:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-interval=\"\"</code>.":"","Add data attributes to register an element with typeahead functionality as shown in the example above.":"","Call the typeahead manually with:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-source=\"\"</code>.":"","array, function":"","The data source to query against. May be an array of strings or a function. The function is passed two arguments, the <code>query</code> value in the input field and the <code>process</code> callback. The function may be used synchronously by returning the data source directly or asynchronously via the <code>process</code> callback's single argument.":"","minLength":"","The minimum character length needed before triggering autocomplete suggestions":"","The subnavigation on the left is a live demo of the affix plugin.":"","To easily add affix behavior to any element, just add <code>data-spy=\"affix\"</code> to the element you want to spy on. Then use offsets to define when to toggle the pinning of an element on and off.":"","It's up to you to manage the position of a pinned element. This is done by styling <code>affix</code>, <code>affix-top</code>, and <code>affix-bottom</code>.":"","Call the affix plugin via JavaScript:":"","When using affix in conjunction with adding or removing of elements from the DOM, you'll want to call the refresh method:":"","Options can be passed via data attributes or JavaScript. For data attributes, append the option name to <code>data-</code>, as in <code>data-offset-top=\"200\"</code>.":"","number | function | object":"","Pixels to offset from screen when calculating position of scroll. If a single number is provide, the offset will be applied in both top and left directions. To listen for a single direction, or multiple unique offsets, just provided an object <code>offset: { x: 10 }</code>. Use a function when you need to dynamically provide an offset (useful for some responsive designs).":"","Bootstrap is built on responsive 12-column grids, layouts, and components.":"","Global settings":"","Bootstrap makes use of certain HTML elements and CSS properties that require the use of the HTML5 doctype. Include it at the beginning of all your projects.":"","Bootstrap sets basic global display, typography, and link styles. Specifically, we:":"","Remove <code>margin</code> on the body":"","Use the <code>@baseFontFamily</code>, <code>@baseFontSize</code>, and <code>@baseLineHeight</code> attributes as our typographic base":"","These styles can be found within <strong>scaffolding.less</strong>.":"","With Bootstrap 2, the old reset block has been dropped in favor of <a href=\"http://necolas.github.com/normalize.css/\" target=\"_blank\">Normalize.css</a>, a project by <a href=\"http://twitter.com/necolas\" target=\"_blank\">Nicolas Gallagher</a> that also powers the <a href=\"http://html5boilerplate.com\" target=\"_blank\">HTML5 Boilerplate</a>. While we use much of Normalize within our <strong>reset.less</strong>, we have removed some elements specifically for Bootstrap.":"","Default grid system":"","Live grid example":"","The default Bootstrap grid system utilizes <strong>12 columns</strong>, making for a 940px wide container without <a href=\"#responsive\">responsive features</a> enabled. With the responsive CSS file added, the grid adapts to be 724px and 1170px wide depending on your viewport. Below 767px viewports, the columns become fluid and stack vertically.":"","Basic grid HTML":"","For a simple two column layout, create a <code>.row</code> and add the appropriate number of <code>.span*</code> columns. As this is a 12-column grid, each <code>.span*</code> spans a number of those 12 columns, and should always add up to 12 for each row (or the number of columns in the parent).":"","Given this example, we have <code>.span4</code> and <code>.span8</code>, making for 12 total columns and a complete row.":"","Move columns to the left using <code>.offset*</code> classes. Each class increases the left margin of a column by a whole column. For example, <code>.offset4</code> moves <code>.span4</code> over four columns.":"","To nest your content with the default grid, add a new <code>.row</code> and set of <code>.span*</code> columns within an existing <code>.span*</code> column. Nested rows should include a set of columns that add up to the number of columns of its parent.":"","Live fluid grid example":"","The fluid grid system uses percents instead of pixels for column widths. It has the same responsive capabilities as our fixed grid system, ensuring proper proportions for key screen resolutions and devices.":"","Basic fluid grid HTML":"","Make any row \"fluid\" by changing <code>.row</code> to <code>.row-fluid</code>. The column classes stay the exact same, making it easy to flip between fixed and fluid grids.":"","Fluid offsetting":"","Operates the same way as the fixed grid system offsetting: add <code>.offset*</code> to any column to offset by that many columns.":"","Nesting with fluid grids is a bit different: the number of nested columns should not match the parent's number of columns. Instead, each level of nested columns are reset because each row takes up 100% of the parent column.":"","Provides a common fixed-width (and optionally responsive) layout with only <code>&lt;div class=\"container\"&gt;</code> required.":"","Create a fluid, two-column page with <code>&lt;div class=\"container-fluid\"&gt;</code>&mdash;great for applications and docs.":"","Enabling responsive features":"","Turn on responsive CSS in your project by including the proper meta tag and additional stylesheet within the <code>&lt;head&gt;</code> of your document. If you've compiled Bootstrap from the Customize page, you need only include the meta tag.":""," Bootstrap doesn't include responsive features by default at this time as not everything needs to be responsive. Instead of encouraging developers to remove this feature, we figure it best to enable it as needed.":"","About responsive Bootstrap":"","Phones":"","Phones to tablets":"","For faster mobile-friendly development, use these utility classes for showing and hiding content by device. Below is a table of the available classes and their effect on a given media query layout (labeled by device). They can be found in <code>responsive.less</code>.":"","Phones <small>767px and below</small>":"","Tablets <small>979px to 768px</small>":"","Desktops <small>Default</small>":"","Responsive utilities test case":""}}